from modules.const import __version__

firstHello_1, firstHello_2 = "Ой, привет ", "! Вижу ты тут в первые."
dev = "Функция уже в разработке, скоро станет доступна, осталось совсем чуть чуть :)"
whoMe = f"Привет🖐!\nЯ бот помощник 🤖, созданный специально для облегчения твоей жизни 😜❤\n\n✌ Бот-помощник SchoolSchedule\n✅ Версия -> {__version__}\n📑 Source code available on https://github.com/denbingon/schoolschedule\n📑 Автор -> https://vk.com/denbingon"
dontKnow = 'Не понимаю о чем ты... Воспользуйся коммандой "помощь" и я расскажу тебе что я умею!'
